{
  "version_year": 2025,
  "effective_date": "2025-01-01",
  "ranks": [
    {
      "code": "scout",
      "name": "Scout",
      "display_order": 1,
      "is_eagle_required": true,
      "description": "The first rank in Scouts BSA, demonstrating basic Scouting skills and understanding of the Scout Oath and Law.",
      "requirements": [
        {
          "number": "1a",
          "description": "Repeat from memory the Scout Oath, Scout Law, Scout motto, and Scout slogan. In your own words, explain their meaning."
        },
        {
          "number": "1b",
          "description": "Explain what Scout spirit is. Describe some ways you have shown Scout spirit by practicing the Scout Oath, Scout Law, Scout motto, and Scout slogan."
        },
        {
          "number": "1c",
          "description": "Demonstrate the Scout sign, salute, and handshake. Explain when they should be used."
        },
        {
          "number": "1d",
          "description": "Describe the First Class Scout badge and tell what each part stands for. Explain the significance of the First Class Scout badge."
        },
        {
          "number": "1e",
          "description": "Repeat from memory the Outdoor Code. In your own words, explain what the Outdoor Code means to you."
        },
        {
          "number": "1f",
          "description": "Repeat from memory the Pledge of Allegiance. In your own words, explain its meaning."
        },
        {
          "number": "2",
          "description": "After attending at least one Scout troop meeting, do the following:",
          "sub_requirements": [
            {
              "letter": "a",
              "description": "Describe how the Scouts in the troop provide its leadership."
            },
            {
              "letter": "b",
              "description": "Describe the four steps of Scout advancement."
            },
            {
              "letter": "c",
              "description": "Describe what the troop ones and rank expectations are for a new Scout joining the troop."
            }
          ]
        },
        {
          "number": "3a",
          "description": "Explain the patrol method. Describe the types of patrols that are used in your troop."
        },
        {
          "number": "3b",
          "description": "Become familiar with your patrol name, emblem, flag, and yell. Explain how these items create patrol spirit."
        },
        {
          "number": "4a",
          "description": "Show how to tie a square knot, two half-hitches, and a taut-line hitch. Explain how each knot is used."
        },
        {
          "number": "4b",
          "description": "Show the proper care of a rope by learning how to whip and fuse the ends of different kinds of rope."
        },
        {
          "number": "5",
          "description": "Tell what you need to know about pocketknife safety."
        },
        {
          "number": "6",
          "description": "With your parent or guardian, complete the exercises in the pamphlet How to Protect Your Children From Child Abuse: A Parent's Guide and earn the Cyber Chip award for your grade."
        },
        {
          "number": "7",
          "description": "Since joining the troop and while working on the Scout rank, participate in a Scoutmaster conference."
        }
      ]
    },
    {
      "code": "tenderfoot",
      "name": "Tenderfoot",
      "display_order": 2,
      "is_eagle_required": true,
      "description": "The second rank in Scouts BSA, building on Scout skills with camping, citizenship, and personal fitness.",
      "requirements": [
        {
          "number": "1a",
          "description": "Present yourself to your leader, prepared for an overnight camping trip. Show the personal and camping gear you will use. Show the right way to pack and carry it."
        },
        {
          "number": "1b",
          "description": "Spend at least one night on a patrol or troop campout. Sleep in a tent you have helped pitch."
        },
        {
          "number": "1c",
          "description": "Tell how you practiced the Outdoor Code on a campout or outing."
        },
        {
          "number": "2a",
          "description": "On the campout, assist in preparing one of the meals. Tell why it is important for each patrol member to share in meal preparation and cleanup."
        },
        {
          "number": "2b",
          "description": "While on a campout, demonstrate the appropriate method of safely cleaning items used to prepare, serve, and eat a meal."
        },
        {
          "number": "2c",
          "description": "Explain the importance of eating together as a patrol."
        },
        {
          "number": "3a",
          "description": "Demonstrate a practical use of the square knot."
        },
        {
          "number": "3b",
          "description": "Demonstrate a practical use of two half-hitches."
        },
        {
          "number": "3c",
          "description": "Demonstrate a practical use of the taut-line hitch."
        },
        {
          "number": "3d",
          "description": "Demonstrate proper care, sharpening, and use of the knife, saw, and ax. Describe when each should be used."
        },
        {
          "number": "4a",
          "description": "Show first aid for the following: simple cuts and scrapes, blisters on the hand and foot, minor (thermal/heat) burns or scalds (superficial, or first-degree), bites or stings of insects and ticks, venomous snakebite, nosebleed, frostbite and sunburn, choking."
        },
        {
          "number": "4b",
          "description": "Describe common poisonous or hazardous plants; identify any that grow in your local area or campsite location. Tell how to treat for exposure to them."
        },
        {
          "number": "4c",
          "description": "Tell what you can do while on a campout or other outdoor activity to prevent or reduce the occurrence of injuries or exposure listed in Tenderfoot requirements 4a and 4b."
        },
        {
          "number": "4d",
          "description": "Assemble a personal first-aid kit to carry with you on future campouts and hikes. Tell how each item in the kit would be used."
        },
        {
          "number": "5a",
          "description": "Explain the importance of the buddy system as it relates to your personal safety on outings and in your neighborhood. Use the buddy system while on a troop or patrol outing."
        },
        {
          "number": "5b",
          "description": "Describe what to do if you become lost on a hike or campout."
        },
        {
          "number": "5c",
          "description": "Explain the rules of safe hiking, both on the highway and cross-country, during the day and at night."
        },
        {
          "number": "6a",
          "description": "Record your best in the following tests: push-ups, pull-ups or curl-ups or sit-ups, sit-and-reach or V-sit, one-mile walk/run."
        },
        {
          "number": "6b",
          "description": "Develop and describe a plan for improvement in each of the activities listed in Tenderfoot requirement 6a. Keep track of your activity for at least 30 days."
        },
        {
          "number": "6c",
          "description": "Show improvement (of any degree) in each activity listed in Tenderfoot requirement 6a after practicing for 30 days."
        },
        {
          "number": "7a",
          "description": "Demonstrate how to display, raise, lower, and fold the U.S. flag."
        },
        {
          "number": "7b",
          "description": "Participate in a total of one hour of service in one or more service projects approved by your Scoutmaster. Explain how your service to others relates to the Scout slogan and Scout motto."
        },
        {
          "number": "8",
          "description": "Describe the steps in Scouting's Teaching EDGE method. Use the Teaching EDGE method to teach another person how to tie the square knot."
        },
        {
          "number": "9",
          "description": "Demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God and how you have lived four different points of the Scout Law in your everyday life."
        },
        {
          "number": "10",
          "description": "While working toward the Tenderfoot rank, and after completing Scout rank requirement 7, participate in a Scoutmaster conference."
        },
        {
          "number": "11",
          "description": "Successfully complete your board of review for the Tenderfoot rank."
        }
      ]
    },
    {
      "code": "second_class",
      "name": "Second Class",
      "display_order": 3,
      "is_eagle_required": true,
      "description": "Building stronger outdoor skills, first aid, and citizenship.",
      "requirements": [
        {
          "number": "1a",
          "description": "Since joining Scouts BSA, participate in five separate troop/patrol activities, at least three of which must be held outdoors. Of the outdoor ones, at least two must include overnight camping. These activities do not include troop or patrol meetings. On campouts, ones must include cooking and sleeping in the outdoors."
        },
        {
          "number": "1b",
          "description": "Explain the principles of Leave No Trace and tell how you practiced them on a campout or outing. This outing must be different from the one used for Tenderfoot requirement 1c."
        },
        {
          "number": "1c",
          "description": "On one of these campouts, select a location for your patrol site and demonstrate proper care of the site both before leaving and after your patrol has departed."
        },
        {
          "number": "2a",
          "description": "Explain when it is appropriate to use a fire for cooking or other purposes and when it would not be appropriate to do so."
        },
        {
          "number": "2b",
          "description": "Use the tools listed in Tenderfoot requirement 3d to prepare tinder, kindling, and fuel wood for a cooking fire."
        },
        {
          "number": "2c",
          "description": "At an approved outdoor location and time, use the tinder, kindling, and fuel wood from Second Class requirement 2b to demonstrate how to build a fire. Unless prohibited by local fire restrictions, light the fire. After allowing the fire to burn safely for at least two minutes and after the fire is safely out, demonstrate how to safely dispose of any ashes remaining."
        },
        {
          "number": "2d",
          "description": "Explain when it is appropriate to use a lightweight stove and when it is appropriate to use a propane stove. Set up a lightweight stove or propane stove. Light the stove, unless prohibited by local fire restrictions. Describe the safety procedures for using these types of stoves."
        },
        {
          "number": "2e",
          "description": "On one campout, plan and cook one hot breakfast or lunch, selecting foods from MyPlate or the current USDA nutritional model. Explain the importance of good nutrition. Demonstrate how to transport, store, and prepare the foods you selected."
        },
        {
          "number": "2f",
          "description": "Demonstrate tying the sheet bend knot. Describe a situation in which you would use this knot."
        },
        {
          "number": "2g",
          "description": "Demonstrate tying the bowline knot. Describe a situation in which you would use this knot."
        },
        {
          "number": "3a",
          "description": "Demonstrate how a compass works and how to orient a map. Use a map to point out and tell the meaning of five map symbols."
        },
        {
          "number": "3b",
          "description": "Using a compass and map together, take a 5-mile hike (or 10 miles by bike) approved by your adult leader and your parent or guardian."
        },
        {
          "number": "3c",
          "description": "Describe some hazards or injuries that you might encounter on your hike and what you can do to help prevent them."
        },
        {
          "number": "3d",
          "description": "Demonstrate how to find directions during the day and at night without using a compass or an electronic device."
        },
        {
          "number": "4",
          "description": "Identify or show evidence of at least 10 kinds of wild animals (such as birds, mammals, reptiles, fish, or mollusks) found in your local area or camping location. You may show evidence by tracks, signs, or by reporting that you identified a bird or other animal."
        },
        {
          "number": "5a",
          "description": "Tell what precautions must be taken for a safe swim."
        },
        {
          "number": "5b",
          "description": "Demonstrate your ability to pass the BSA beginner test: Jump feetfirst into water over your head in depth, level off and swim 25 feet on the surface, stop, turn sharply, resume swimming, then return to your starting place."
        },
        {
          "number": "5c",
          "description": "Demonstrate water rescue methods by reaching with your arm or leg, by reaching with a suitable object, and by throwing lines and objects."
        },
        {
          "number": "5d",
          "description": "Explain why swimming rescues should not be attempted when a reaching or throwing rescue is possible. Explain why and how a rescue swimmer should avoid contact with the victim."
        },
        {
          "number": "6a",
          "description": "Demonstrate first aid for the following: object in the eye, bite of a warm-blooded animal, puncture wounds from a splinter, nail, and fishhook, serious burns (partial thickness, or second-degree), heat exhaustion, shock, heatstroke, dehydration, hypothermia, hyperventilation."
        },
        {
          "number": "6b",
          "description": "Show what to do for \"hurry\" cases of stopped breathing, stroke, severe bleeding, and ingested poisoning."
        },
        {
          "number": "6c",
          "description": "Tell what utility services exist in your home or meeting place. Describe potential hazards associated with these utilities and tell how to respond in emergency situations."
        },
        {
          "number": "6d",
          "description": "Develop an emergency action plan for your home that includes what to do in case of fire, move, chemical, or water, and natural disasters."
        },
        {
          "number": "7a",
          "description": "After completing Tenderfoot requirement 6c, be physically active at least 30 minutes each day for five days a week for four weeks. Keep track of your activities."
        },
        {
          "number": "7b",
          "description": "Share your challenges and successes in completing Second Class requirement 7a. Set a goal for continuing to include physical activity as part of your daily life and plan for how you will do so."
        },
        {
          "number": "7c",
          "description": "Participate in a school, community, or troop program on the dangers of using drugs, alcohol, and tobacco and other practices that could be harmful to your health. Discuss your participation in the program with your family, and explain the dangers of substance addictions. Report to your Scoutmaster or other adult leader in your troop about which parts of the program you found to be the most helpful."
        },
        {
          "number": "8a",
          "description": "Participate in a flag ceremony for your school, religious institution, chartered organization, community, or Scouting activity."
        },
        {
          "number": "8b",
          "description": "Explain what respect is due the flag of the United States."
        },
        {
          "number": "8c",
          "description": "With your parents or guardian, decide on an amount of money that you would like to earn, based on the cost of a troop/patrol activity, and develop a written plan to earn that amount."
        },
        {
          "number": "8d",
          "description": "At a minimum of three locations, compare the cost of the item for which you are saving to accomplish Second Class requirement 8c. After completing Second Class requirement 8c, tell whether you saved as much as you could have."
        },
        {
          "number": "8e",
          "description": "Participate in two hours of service through one or more service projects approved by your Scoutmaster. Tell how your service to others relates to the Scout Oath."
        },
        {
          "number": "9a",
          "description": "Explain the three R's of personal safety and protection."
        },
        {
          "number": "9b",
          "description": "Describe bullying; tell what the appropriate response is to someone who is bullying you or another person."
        },
        {
          "number": "10",
          "description": "Demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God and how you have lived four different points of the Scout Law (not ones listed in requirement 9 for Tenderfoot) in your everyday life."
        },
        {
          "number": "11",
          "description": "While working toward the Second Class rank, and after completing Tenderfoot requirement 10, participate in a Scoutmaster conference."
        },
        {
          "number": "12",
          "description": "Successfully complete your board of review for the Second Class rank."
        }
      ]
    },
    {
      "code": "first_class",
      "name": "First Class",
      "display_order": 4,
      "is_eagle_required": true,
      "description": "Mastery of outdoor skills, leadership, and service to others.",
      "requirements": [
        {
          "number": "1a",
          "description": "Since joining Scouts BSA, participate in 10 separate troop/patrol activities, at least six of which must be held outdoors. Of the outdoor ones, at least three must include overnight camping. These activities do not include troop or patrol meetings. On campouts, ones must include cooking and sleeping in the outdoors."
        },
        {
          "number": "1b",
          "description": "Explain each of the principles of Tread Lightly! and tell how you practiced them on a campout or outing. This outing must be different from the ones used for Tenderfoot requirement 1c and Second Class requirement 1b."
        },
        {
          "number": "2a",
          "description": "Help plan a menu for one of the above campouts that includes at least one breakfast, one lunch, and one dinner, and that requires cooking at least two of the meals. Tell how the menu includes the foods from MyPlate or the current USDA nutritional model and how it meets nutritional needs for the planned activity or campout."
        },
        {
          "number": "2b",
          "description": "Using the menu planned in First Class requirement 2a, make a list showing a budget and the food amounts needed to feed three or more youth. Secure the ingredients."
        },
        {
          "number": "2c",
          "description": "Show which pots, pans, and other gear will be needed to cook and serve these meals."
        },
        {
          "number": "2d",
          "description": "Demonstrate the procedures to follow in the safe handling and storage of fresh meats, dairy products, eggs, vegetables, and other perishable food products. Show how to properly dispose of camp garbage, cans, plastic containers, and other refuse."
        },
        {
          "number": "2e",
          "description": "On one campout, serve as cook. Supervise your assistant(s) in using a stove or building a cooking fire. Prepare the breakfast, lunch, and dinner planned in First Class requirement 2a. Supervise the cleanup."
        },
        {
          "number": "3a",
          "description": "Discuss when you should and should not use lashings."
        },
        {
          "number": "3b",
          "description": "Demonstrate tying the timber hitch and clove hitch."
        },
        {
          "number": "3c",
          "description": "Demonstrate tying the square, shear, and diagonal lashings by joining two or more poles or staves together."
        },
        {
          "number": "3d",
          "description": "Use lashings to make a useful camp gadget or structure."
        },
        {
          "number": "4a",
          "description": "Using a map and compass, complete an orienteering course that covers at least one mile and requires measuring the height and/or width of designated items (tree, tower, canyon, ditch, etc.)."
        },
        {
          "number": "4b",
          "description": "Demonstrate how to use a handheld GPS unit, GPS app on a smartphone, or other electronic navigation system. Use GPS to find your current location, a destination of your choice, and the route you will take to get there. Follow that route to arrive at your destination."
        },
        {
          "number": "5a",
          "description": "Identify or show evidence of at least 10 kinds of native plants found in your local area or camping location. You may show evidence by identifying the leaf, flower, fruit, nut, smell, or other characteristic of the tree, shrub, or plant."
        },
        {
          "number": "5b",
          "description": "Identify two ways to obtain a weather forecast for an upcoming activity. Explain why weather forecasts are important when planning for an event."
        },
        {
          "number": "5c",
          "description": "Describe at least three natural indicators of impending hazardous weather, the potential dangers of each, and the appropriate actions to take."
        },
        {
          "number": "5d",
          "description": "Describe extreme weather conditions you might encounter in the outdoors in your local geographic area. Discuss how you would determine ahead of time the potential risk of these types of weather dangers, alternative planning considerations to avoid such risks, and how you would prepare for and respond to those weather conditions."
        },
        {
          "number": "6a",
          "description": "Successfully complete the BSA swimmer test."
        },
        {
          "number": "6b",
          "description": "Tell what precautions must be taken for a safe trip afloat."
        },
        {
          "number": "6c",
          "description": "Identify the basic parts of a canoe, kayak, or other boat. Identify the parts of a paddle or an oar."
        },
        {
          "number": "6d",
          "description": "Describe proper body positioning in a watercraft, depending on the type and size of the vessel. Explain the importance of proper body position in the boat."
        },
        {
          "number": "6e",
          "description": "With a helper and a practice victim, show a line rescue both as tender and as rescuer. (The practice victim should be approximately 30 feet from shore in deep water.)"
        },
        {
          "number": "7a",
          "description": "Demonstrate bandages for a sprained ankle and for injuries on the head, the upper arm, and the collarbone."
        },
        {
          "number": "7b",
          "description": "By yourself and with a partner, show how to transport a person from a smoke-filled room, move a person with a suspected spinal injury, carry an injured person."
        },
        {
          "number": "7c",
          "description": "Tell the five most common signals of a heart attack. Explain the steps (procedures) in cardiopulmonary resuscitation (CPR)."
        },
        {
          "number": "7d",
          "description": "Tell what utility services exist in your home or meeting place. Describe potential hazards associated with these utilities and tell how to respond in emergency situations."
        },
        {
          "number": "7e",
          "description": "Develop an emergency action plan for your home that includes what to do in case of fire, move, chemical, or water, and natural disasters."
        },
        {
          "number": "7f",
          "description": "Explain how to obtain potable water in an emergency."
        },
        {
          "number": "8a",
          "description": "After completing Second Class requirement 7a, be physically active at least 30 minutes each day for five days a week for four weeks. Keep track of your activities."
        },
        {
          "number": "8b",
          "description": "Share your challenges and successes in completing First Class requirement 8a. Set a goal for continuing to include physical activity as part of your daily life."
        },
        {
          "number": "9a",
          "description": "Visit and discuss with a selected individual approved by your leader (for example, an elected official, judge, attorney, civil servant, principal, or teacher) the constitutional rights and obligations of a U.S. citizen."
        },
        {
          "number": "9b",
          "description": "Investigate an environmental issue affecting your community. Share what you learned with your patrol or troop. Tell what, if anything, you think should be done to address the concern."
        },
        {
          "number": "9c",
          "description": "On a Scouting or family outing, take note of the trash and garbage you produce. Before your next similar outing, decide how you can reduce, recycle, or repurpose what you throw away. Put your plan into action during the outing."
        },
        {
          "number": "9d",
          "description": "Participate in three hours of service through one or more service projects approved by your Scoutmaster. The project(s) must not be the same as service ones counted toward Tenderfoot requirement 7b and Second Class requirement 8e. Explain how your service to others relates to the Scout Law."
        },
        {
          "number": "10",
          "description": "Tell someone who is eligible to join Scouts BSA, or an inactive Scout, about your Scouting activities. Invite this person to an outing, activity, service project, or meeting. Provide information on how to join, or encourage the inactive Scout to become active. Share your efforts with your Scoutmaster or other adult leader."
        },
        {
          "number": "11",
          "description": "Demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God and how you have lived four different points of the Scout Law (not ones listed in requirements for Tenderfoot and Second Class ranks) in your everyday life."
        },
        {
          "number": "12",
          "description": "While working toward the First Class rank, and after completing Second Class requirement 11, participate in a Scoutmaster conference."
        },
        {
          "number": "13",
          "description": "Successfully complete your board of review for the First Class rank."
        }
      ]
    },
    {
      "code": "star",
      "name": "Star",
      "display_order": 5,
      "is_eagle_required": true,
      "description": "First rank after First Class, focusing on merit badges, leadership, and service.",
      "requirements": [
        {
          "number": "1",
          "description": "Be active in your troop for at least four months as a First Class Scout."
        },
        {
          "number": "2",
          "description": "As a First Class Scout, demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God and how you have lived the Scout Oath and Scout Law in your everyday life."
        },
        {
          "number": "3",
          "description": "Earn six merit badges, including any four from the required list for Eagle. You may choose any of the 14 merit badges on the required list for Eagle to fulfill this requirement.",
          "note": "Eagle-required merit badges: Camping, Citizenship in the Community, Citizenship in the Nation, Citizenship in the World, Communication, Cooking, Emergency Preparedness OR Lifesaving, Environmental Science OR Sustainability, First Aid, Hiking OR Cycling OR Swimming, Personal Fitness, Personal Management, Family Life, and Citizenship in Society."
        },
        {
          "number": "4",
          "description": "While a First Class Scout, participate in six hours of service through one or more service projects approved by your Scoutmaster."
        },
        {
          "number": "5",
          "description": "While a First Class Scout, serve actively in your troop for four months in one or more of the following positions of responsibility: Scout troop. Boy Scout-elected: Patrol leader, senior patrol leader, assistant senior patrol leader, troop guide, Order of the Arrow troop representative, den chief, scribe, librarian, historian, quartermaster, bugler, junior assistant Scoutmaster, chaplain aide, instructor, webmaster, or outdoor ethics guide. Boy Scout-appointed (by Scoutmaster): troop guide, Order of the Arrow troop representative, den chief, scribe, leave no trace trainer, instructor, or chaplain aide.\n\nVarsity Scout team. Varsity Scout-elected: Varsity Scout team captain, Varsity Scout co-captain. Varsity Scout-appointed (by Varsity Scout Coach): Program manager, team secretary, Order of the Arrow team representative, den chief, chaplain aide, historian, or webmaster.\n\nVenturing crew/Sea Scout ship. Crew/ship: President, vice president, secretary, treasurer, den chief, historian, guide, quartermaster, boatswain, boatswain's mate, yeoman, purser, storekeeper, or webmaster."
        },
        {
          "number": "6",
          "description": "With your parent or guardian, complete the exercises in the pamphlet How to Protect Your Children From Child Abuse: A Parent's Guide and earn the Cyber Chip award for your grade."
        },
        {
          "number": "7",
          "description": "While a First Class Scout, participate in a Scoutmaster conference."
        },
        {
          "number": "8",
          "description": "Successfully complete your board of review for the Star rank."
        }
      ]
    },
    {
      "code": "life",
      "name": "Life",
      "display_order": 6,
      "is_eagle_required": true,
      "description": "Second-to-last rank before Eagle, demonstrating continued growth in leadership and merit badges.",
      "requirements": [
        {
          "number": "1",
          "description": "Be active in your troop for at least six months as a Star Scout."
        },
        {
          "number": "2",
          "description": "As a Star Scout, demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God and how you have lived the Scout Oath and Scout Law in your everyday life."
        },
        {
          "number": "3",
          "description": "Earn five more merit badges (so that you have 11 in all), including any three more from the required list for Eagle."
        },
        {
          "number": "4",
          "description": "While a Star Scout, participate in six hours of service through one or more service projects approved by your Scoutmaster."
        },
        {
          "number": "5",
          "description": "While a Star Scout, serve actively in your troop for six months in one or more of the following positions of responsibility (or carry out a Scoutmaster-approved leadership project to help the troop): Scout troop. Boy Scout-elected: Patrol leader, senior patrol leader, assistant senior patrol leader, troop guide, Order of the Arrow troop representative, den chief, scribe, librarian, historian, quartermaster, bugler, junior assistant Scoutmaster, chaplain aide, instructor, webmaster, or outdoor ethics guide. Boy Scout-appointed (by Scoutmaster): troop guide, Order of the Arrow troop representative, den chief, scribe, leave no trace trainer, instructor, or chaplain aide.\n\nVarsity Scout team. Varsity Scout-elected: Varsity Scout team captain, Varsity Scout co-captain. Varsity Scout-appointed (by Varsity Scout Coach): Program manager, team secretary, Order of the Arrow team representative, den chief, chaplain aide, historian, or webmaster.\n\nVenturing crew/Sea Scout ship. Crew/ship: President, vice president, secretary, treasurer, den chief, historian, guide, quartermaster, boatswain, boatswain's mate, yeoman, purser, storekeeper, or webmaster."
        },
        {
          "number": "6",
          "description": "While a Star Scout, use the Teaching EDGE method to teach another Scout (preferably younger than you) the skills from ONE of the following choices, so that the Scout is prepared to pass those requirements to their Scoutmaster's satisfaction.",
          "sub_requirements": [
            {
              "letter": "a",
              "description": "Tenderfoot 4a and 4b"
            },
            {
              "letter": "b",
              "description": "Second Class 2b, 2c, and 2d"
            },
            {
              "letter": "c",
              "description": "Second Class 3a and 3d"
            },
            {
              "letter": "d",
              "description": "First Class 3a, 3b, 3c, and 3d"
            },
            {
              "letter": "e",
              "description": "First Class 4a and 4b"
            },
            {
              "letter": "f",
              "description": "Second Class 6a and 6b"
            },
            {
              "letter": "g",
              "description": "First Class 7a and 7b"
            },
            {
              "letter": "h",
              "description": "Three requirements from one of the required Eagle merit badges, as approved by your Scoutmaster"
            }
          ]
        },
        {
          "number": "7",
          "description": "While a Star Scout, participate in a Scoutmaster conference."
        },
        {
          "number": "8",
          "description": "Successfully complete your board of review for the Life rank."
        }
      ]
    },
    {
      "code": "eagle",
      "name": "Eagle",
      "display_order": 7,
      "is_eagle_required": true,
      "description": "The highest rank in Scouts BSA, demonstrating exceptional leadership, service, and character.",
      "requirements": [
        {
          "number": "1",
          "description": "Be active in your troop for at least six months as a Life Scout."
        },
        {
          "number": "2",
          "description": "As a Life Scout, demonstrate Scout spirit by living the Scout Oath and Scout Law. Tell how you have done your duty to God, how you have lived the Scout Oath and Scout Law in your everyday life, and how your understanding of the Scout Oath and Scout Law will guide your life in the future. List on your Eagle Scout Rank Application the names of individuals who know you personally and would be willing to provide a recommendation on your behalf."
        },
        {
          "number": "3",
          "description": "Earn a total of 21 merit badges (10 more than required for Life), including these 14 merit badges: (a) First Aid, (b) Citizenship in the Community, (c) Citizenship in the Nation, (d) Citizenship in the World, (e) Citizenship in Society, (f) Communication, (g) Cooking, (h) Personal Fitness, (i) Emergency Preparedness OR Lifesaving, (j) Environmental Science OR Sustainability, (k) Personal Management, (l) Swimming OR Hiking OR Cycling, (m) Camping, and (n) Family Life."
        },
        {
          "number": "4",
          "description": "While a Life Scout, serve actively in your troop for six months in one or more of the following positions of responsibility: Scout troop. Boy Scout-elected: Patrol leader, senior patrol leader, assistant senior patrol leader, troop guide, Order of the Arrow troop representative, den chief, scribe, librarian, historian, quartermaster, bugler, junior assistant Scoutmaster, chaplain aide, instructor, webmaster, or outdoor ethics guide. Boy Scout-appointed (by Scoutmaster): troop guide, Order of the Arrow troop representative, den chief, scribe, leave no trace trainer, instructor, or chaplain aide."
        },
        {
          "number": "5",
          "description": "While a Life Scout, plan, develop, and give leadership to others in a service project helpful to any religious institution, any school, or your community. (The project must benefit an organization other than Scouts BSA.) A project proposal must be approved by the organization benefiting from the effort, your Scoutmaster and unit committee, and the council or district before you start. You must use the Eagle Scout Service Project Workbook, BSA publication No. 512-927, in meeting this requirement."
        },
        {
          "number": "6",
          "description": "While a Life Scout, participate in a Scoutmaster conference."
        },
        {
          "number": "7",
          "description": "Successfully complete your board of review for the Eagle Scout rank. In preparation for your board of review, prepare and attach to your Eagle Scout Rank Application a statement of your ambitions and life purpose and a listing of positions held in your religious institution, school, camp, community, or other organizations, during which you demonstrated leadership skills. Include honors and awards received during this service."
        }
      ]
    }
  ]
}
